# Используйте официальный образ Golang для сборки вашего приложения
FROM golang:1.21 as builder

# Установите рабочий каталог в контейнере
WORKDIR /app

# Копируйте файлы модулей Go
COPY go.mod ./
COPY go.sum ./

# Загрузите зависимости
RUN go mod download

# Копируйте исходный код приложения в контейнер
COPY . .

# Запуск тестов
RUN go test ./...

# Скомпилируйте ваше приложение
RUN CGO_ENABLED=0 GOOS=linux go build -o myapp

# Используйте образ alpine для окончательного контейнера из соображений безопасности и размера
FROM alpine:latest

# Установите рабочий каталог в контейнере
WORKDIR /root/

# Скопируйте скомпилированный исполняемый файл из стадии сборки
COPY --from=builder /app/myapp .

# Скопируйте файл конфигурации ord1.json в контейнер
COPY --from=builder /app/ord1.json .

# Откройте порт 8000, если ваше приложение его использует
EXPOSE 4222

# Запустите ваше приложение
CMD ["./myapp"]
